'_ It's not recommend to manage the resources out of Terraform and try handle the changes by Terraform._'
I completely agree. However, it's a likely scenario to occur, which is exactly the reason we would like to utilise Terraform to define the desired state - and reconcile in the event of divergence (however it may have happened). It's in line with one of the core principles of GitOps - Continuous reconciliation of state using automation. 

With the reproduction, I wonder if this additional information will make a difference?
1) My test AzDO Org is attached to an AAD as an IdP
2) The Service Principal case matters - when the resource compares defined configuration to current state, it seems to do a case sensitive comparison. As an example, if I define 'joe.smith@org.onmicrosoft.com', and the AAD service principal is 'Joe.Smith@org.onmicrosoft.com', that difference will be picked up and the resource will trigger a replacement. Here's an example output from a `terraform plan demonstrating that point:
```
# azuredevops_user_entitlement.add_users["joe.smith@org.onmicrosoft.com"] must be replaced
-/+ resource "azuredevops_user_entitlement" "add_users" {
      ~ descriptor           = "aad.ODIxZGQ0NzUtMDQ2MC03NjcwLWE2MWYtN2EwMDBjMWI3NmE4" -> (known after apply)
      ~ id                   = "821dd475-0460-6670-a61f-000000" -> (known after apply)
      ~ origin               = "aad" -> (known after apply)
      ~ origin_id            = "17ccf77b-cf30-41a5-bc99-1235532" -> (known after apply)
      ~ principal_name       = "Joe.Smith@org.onmicrosoft.com" -> "joe.smith@org.onmicrosoft.com" # forces replacement
        # (2 unchanged attributes hidden)
    }
```
I hope my reply makes sense. I can replicate this error reliably every time with the code snippet I provided in the issue.
